#+title: CKY Parsing With Independence Constraints
#+author: Joseph Irwin
#+OPTIONS: H:2 toc:nil _:{}
#+LATEX_HEADER: \usepackage{amsmath}
#+LaTeX_HEADER: \usepackage{times}
#+LaTeX_HEADER: \usepackage{url}
#+LaTeX_HEADER: \usepackage{underscore}
#+LATEX_HEADER: \usepackage{forest}
#+LATEX_HEADER: \DeclareMathOperator*{\argmin}{arg\,min}
#+LATEX_HEADER: \DeclareMathOperator*{\argmax}{arg\,max}
#+LaTeX_HEADER: \newcommand{\BigO}[1]{\ensuremath{\operatorname{O}\bigl(#1\bigr)}}

# file:paper.pdf

*** Linear Classifier

Features: $p$, $P_{0}$, $P_{1}$

#+BEGIN_LaTeX
\resizebox{12cm}{!}{
#+END_LaTeX

#+attr_latex: :center nil
| SentLen | Constraints   | (P/R/F_{1})         | time(s) |  #rules |                      |  #edges |                      |   F_1 |       | #failed parses |
|---------+---------------+---------------------+---------+---------+----------------------+---------+----------------------+-------+-------+----------------|
|       0 | default       | (88.95/76.16/82.06) |  1283.0 | 1.33e10 | \hspace{-1em} (77%)  | 1.08e10 | \hspace{-1em} (62%)  | 83.71 | -2.14 |             15 |
|       0 | precision     | (90.42/72.20/80.29) |  1143.3 | 1.36e10 | \hspace{-1em} (79%)  | 1.13e10 | \hspace{-1em} (65%)  | 84.05 | -1.80 |              7 |
|       0 | max precision | (95.57/47.14/63.13) |  1384.4 | 1.53e10 | \hspace{-1em} (89%)  | 1.42e10 | \hspace{-1em} (81%)  | 85.55 | -0.30 |              2 |
|       0 | recall        | (71.73/90.25/79.93) |  1024.8 | 1.23e10 | \hspace{-1em} (72%)  | 7.80e09 | \hspace{-1em} (45%)  | 78.74 | -7.11 |            136 |
|       0 | oracle        | (100/100/100)       |  1013.0 | 1.22e10 | \hspace{-1em} (71%)  | 8.47e09 | \hspace{-1em} (48%)  | 86.71 |  0.86 |              4 |
|      20 | default       | (88.95/76.16/82.06) |  1126.9 | 1.38e10 | \hspace{-1em} (80%)  | 1.12e10 | \hspace{-1em} (64%)  | 84.17 | -1.68 |              9 |
|      20 | precision     | (90.42/72.20/80.29) |  1313.0 | 1.41e10 | \hspace{-1em} (82%)  | 1.16e10 | \hspace{-1em} (66%)  | 84.43 | -1.42 |              4 |
|      20 | max precision | (95.57/47.14/63.13) |  1338.6 | 1.56e10 | \hspace{-1em} (91%)  | 1.44e10 | \hspace{-1em} (82%)  | 85.59 | -0.26 |              2 |
|      20 | recall        | (71.73/90.25/79.93) |  1121.8 | 1.29e10 | \hspace{-1em} (75%)  | 8.24e09 | \hspace{-1em} (47%)  | 80.38 | -5.47 |            103 |
|      20 | oracle        | (100/100/100)       |  1044.8 | 1.28e10 | \hspace{-1em} (74%)  | 8.90e09 | \hspace{-1em} (51%)  | 86.55 |  0.70 |              2 |
|      30 | default       | (88.95/76.16/82.06) |  1312.3 | 1.51e10 | \hspace{-1em} (88%)  | 1.28e10 | \hspace{-1em} (73%)  | 84.82 | -1.03 |              3 |
|      30 | precision     | (90.42/72.20/80.29) |  1279.7 | 1.53e10 | \hspace{-1em} (89%)  | 1.31e10 | \hspace{-1em} (75%)  | 85.01 | -0.84 |              1 |
|      30 | max precision | (95.57/47.14/63.13) |  1485.9 | 1.63e10 | \hspace{-1em} (95%)  | 1.53e10 | \hspace{-1em} (87%)  | 85.63 | -0.22 |              1 |
|      30 | recall        | (71.73/90.25/79.93) |  1140.5 | 1.44e10 | \hspace{-1em} (84%)  | 1.02e10 | \hspace{-1em} (58%)  | 82.79 | -3.06 |             57 |
|      30 | oracle        | (100/100/100)       |  1125.8 | 1.43e10 | \hspace{-1em} (83%)  | 1.08e10 | \hspace{-1em} (62%)  | 86.33 |  0.48 |              0 |
|      40 | default       | (88.95/76.16/82.06) |  1476.8 | 1.64e10 | \hspace{-1em} (95%)  | 1.51e10 | \hspace{-1em} (86%)  | 85.56 | -0.29 |              1 |
|      40 | precision     | (90.42/72.20/80.29) |  1390.9 | 1.65e10 | \hspace{-1em} (96%)  | 1.52e10 | \hspace{-1em} (87%)  | 85.59 | -0.26 |              0 |
|      40 | max precision | (95.57/47.14/63.13) |  1513.3 | 1.69e10 | \hspace{-1em} (98%)  | 1.65e10 | \hspace{-1em} (94%)  | 85.75 | -0.10 |              0 |
|      40 | recall        | (71.73/90.25/79.93) |  1403.9 | 1.59e10 | \hspace{-1em} (92%)  | 1.33e10 | \hspace{-1em} (76%)  | 84.65 | -1.20 |             14 |
|      40 | oracle        | (100/100/100)       |  1359.5 | 1.60e10 | \hspace{-1em} (93%)  | 1.39e10 | \hspace{-1em} (79%)  | 86.04 |  0.19 |              0 |
|       ∞ | default       | (88.95/76.16/82.06) |  1563.7 | 1.72e10 | \hspace{-1em} (100%) | 1.75e10 | \hspace{-1em} (100%) | 85.85 |  0.00 |              0 |
|       ∞ | precision     | (90.42/72.20/80.29) |  1558.7 | 1.72e10 | \hspace{-1em} (100%) | 1.75e10 | \hspace{-1em} (100%) | 85.85 |  0.00 |              0 |
|       ∞ | max precision | (95.57/47.14/63.13) |  1489.8 | 1.72e10 | \hspace{-1em} (100%) | 1.75e10 | \hspace{-1em} (100%) | 85.85 |  0.00 |              0 |
|       ∞ | recall        | (71.73/90.25/79.93) |  1481.3 | 1.72e10 | \hspace{-1em} (100%) | 1.75e10 | \hspace{-1em} (100%) | 85.85 |  0.00 |              0 |
|       ∞ | oracle        | (100/100/100)       |  1270.3 | 1.72e10 | \hspace{-1em} (100%) | 1.75e10 | \hspace{-1em} (100%) | 85.85 |  0.00 |              0 |
#+TBLFM: $4=$0;%.2e::$6=$0;%.2e::$9=$8-85.85;p4%.2f

#+BEGIN_LaTeX
}
#+END_LaTeX

*** Polynomial (d=3) Kernel

Features: All

#+BEGIN_LaTeX
\resizebox{12cm}{!}{
#+END_LaTeX

#+attr_latex: :center nil
| SentLen | Constraints   | (P/R/F_{1})         | time(s) |  #rules |                      |  #edges |                      |   F_1 |       | #failed parses |
|---------+---------------+---------------------+---------+---------+----------------------+---------+----------------------+-------+-------+----------------|
|       0 | default       | (92.17/88.91/90.51) |  1106.7 | 1.27e10 | \hspace{-1em} (74%)  | 9.74e09 | \hspace{-1em} (56%)  | 84.85 | -1.00 |              6 |
|       0 | precision     | (92.95/86.43/89.58) |  1118.8 | 1.28e10 | \hspace{-1em} (74%)  | 9.84e09 | \hspace{-1em} (56%)  | 85.12 | -0.73 |              4 |
|       0 | max precision | (94.22/79.63/86.31) |  1137.2 | 1.30e10 | \hspace{-1em} (76%)  | 1.02e10 | \hspace{-1em} (58%)  | 85.42 | -0.43 |              2 |
|       0 | recall        | (88.16/91.32/89.71) |  1050.7 | 1.25e10 | \hspace{-1em} (73%)  | 9.25e09 | \hspace{-1em} (53%)  | 84.05 | -1.80 |             33 |
|       0 | oracle        | (100/100/100)       |  1060.3 | 1.22e10 | \hspace{-1em} (71%)  | 8.47e09 | \hspace{-1em} (48%)  | 86.71 |  0.86 |              4 |
|      20 | default       | (92.17/88.91/90.51) |  1070.7 | 1.33e10 | \hspace{-1em} (77%)  | 1.02e10 | \hspace{-1em} (58%)  | 85.08 | -0.77 |              5 |
|      20 | precision     | (92.95/86.43/89.58) |  1172.4 | 1.33e10 | \hspace{-1em} (77%)  | 1.03e10 | \hspace{-1em} (59%)  | 85.25 | -0.60 |              3 |
|      20 | max precision | (94.22/79.63/86.31) |  1092.4 | 1.35e10 | \hspace{-1em} (78%)  | 1.06e10 | \hspace{-1em} (61%)  | 85.41 | -0.44 |              2 |
|      20 | recall        | (88.16/91.32/89.71) |  1088.3 | 1.30e10 | \hspace{-1em} (76%)  | 9.68e09 | \hspace{-1em} (55%)  | 84.75 | -1.10 |              7 |
|      20 | oracle        | (100/100/100)       |  1073.1 | 1.28e10 | \hspace{-1em} (74%)  | 8.90e09 | \hspace{-1em} (51%)  | 86.55 |  0.70 |              2 |
|      30 | default       | (92.17/88.91/90.51) |  1222.6 | 1.47e10 | \hspace{-1em} (86%)  | 1.20e10 | \hspace{-1em} (69%)  | 85.57 | -0.28 |              1 |
|      30 | precision     | (92.95/86.43/89.58) |  1267.5 | 1.48e10 | \hspace{-1em} (86%)  | 1.20e10 | \hspace{-1em} (69%)  | 85.62 | -0.23 |              1 |
|      30 | max precision | (94.22/79.63/86.31) |  1238.7 | 1.49e10 | \hspace{-1em} (87%)  | 1.23e10 | \hspace{-1em} (70%)  | 85.65 | -0.20 |              1 |
|      30 | recall        | (88.16/91.32/89.71) |  1238.0 | 1.46e10 | \hspace{-1em} (85%)  | 1.16e10 | \hspace{-1em} (66%)  | 85.44 | -0.41 |              2 |
|      30 | oracle        | (100/100/100)       |  1165.9 | 1.43e10 | \hspace{-1em} (83%)  | 1.08e10 | \hspace{-1em} (62%)  | 86.33 |  0.48 |              0 |
|      40 | default       | (92.17/88.91/90.51) |  1465.4 | 1.63e10 | \hspace{-1em} (95%)  | 1.49e10 | \hspace{-1em} (85%)  | 85.72 | -0.13 |              0 |
|      40 | precision     | (92.95/86.43/89.58) |  1353.3 | 1.63e10 | \hspace{-1em} (95%)  | 1.49e10 | \hspace{-1em} (85%)  | 85.75 | -0.10 |              0 |
|      40 | max precision | (94.22/79.63/86.31) |  1570.2 | 1.64e10 | \hspace{-1em} (95%)  | 1.50e10 | \hspace{-1em} (86%)  | 85.78 | -0.07 |              0 |
|      40 | recall        | (88.16/91.32/89.71) |  1489.7 | 1.62e10 | \hspace{-1em} (94%)  | 1.47e10 | \hspace{-1em} (84%)  | 85.69 | -0.16 |              1 |
|      40 | oracle        | (100/100/100)       |  1476.0 | 1.60e10 | \hspace{-1em} (93%)  | 1.39e10 | \hspace{-1em} (79%)  | 86.04 |  0.19 |              0 |
|       ∞ | default       | (92.17/88.91/90.51) |  1469.2 | 1.72e10 | \hspace{-1em} (100%) | 1.75e10 | \hspace{-1em} (100%) | 85.85 |  0.00 |              0 |
|       ∞ | precision     | (92.95/86.43/89.58) |  1471.1 | 1.72e10 | \hspace{-1em} (100%) | 1.75e10 | \hspace{-1em} (100%) | 85.85 |  0.00 |              0 |
|       ∞ | max precision | (94.22/79.63/86.31) |  1398.4 | 1.72e10 | \hspace{-1em} (100%) | 1.75e10 | \hspace{-1em} (100%) | 85.85 |  0.00 |              0 |
|       ∞ | recall        | (88.16/91.32/89.71) |  1470.9 | 1.72e10 | \hspace{-1em} (100%) | 1.75e10 | \hspace{-1em} (100%) | 85.85 |  0.00 |              0 |
|       ∞ | oracle        | (100/100/100)       |  1222.6 | 1.72e10 | \hspace{-1em} (100%) | 1.75e10 | \hspace{-1em} (100%) | 85.85 |  0.00 |              0 |
#+TBLFM: $4=$0;%.2e::$6=$0;%.2e::$9=$8-85.85;p4%.2f

#+BEGIN_LaTeX
}
#+END_LaTeX

